config/Catalogs/СвязкиТовараСПоставщиком.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>СвязкиТовараСПоставщиком</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Поставщики</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодТовараПоставщика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТоварФирмы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АССОРТИМЕНТНЫЙ_ПЛАН</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Блокировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеТовараПоставщика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

config/Catalogs/СвязкиТовараСПоставщиком/Ext/ObjectModule.bsl
Процедура ПриЗаписи(Отказ)
	
	//Товар=ТоварФирмы.ПолучитьОбъект();
	//Товар.ЕстьСвязкаСПоставщиком=Истина;
	//Товар.Записать();
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	
	//Запрос=Новый Запрос("ВЫБРАТЬ
	//|	isnull(СУММА(1),0) КАК ЕстьЕщеСвязок
	//|ИЗ
	//|	Справочник.СвязкиТовараСПоставщиком КАК СвязкиТовараСПоставщиком
	//|ГДЕ
	//|	СвязкиТовараСПоставщиком.ТоварФирмы = &ТоварФирмы
	//|	И СвязкиТовараСПоставщиком.Ссылка <> &Ссылка");	
	//
	//Запрос.УстановитьПараметр("ТоварФирмы",ТоварФирмы);
	//Запрос.УстановитьПараметр("Ссылка",ЭтотОбъект.Ссылка);
	//
	//Если Запрос.Выполнить().Выгрузить().Получить(0).ЕстьЕщеСвязок=0 тогда // это последняя связка и она удаляется
	//	Товар=ТоварФирмы.ПолучитьОбъект();
	//	Товар.ЕстьСвязкаСПоставщиком=Ложь;
	//	Товар.Записать();
	//КонецЕсли;
	
	
	
КонецПроцедуры

Функция СвязкаСуществует()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИСТИНА КАК ЭлементНайден
	|ИЗ
	|	Справочник.СвязкиТовараСПоставщиком КАК СвязкиТовараСПоставщиком
	|ГДЕ
	|	СвязкиТовараСПоставщиком.Поставщик = &Поставщик
	|	И СвязкиТовараСПоставщиком.КодТовараПоставщика = &КодТовараПоставщика
	|	И СвязкиТовараСПоставщиком.ТоварФирмы = &ТоварФирмы и Ссылка <> &Ссылка";
	
	Запрос.УстановитьПараметр("КодТовараПоставщика", КодТовараПоставщика);
	Запрос.УстановитьПараметр("Поставщик", Поставщик);
	Запрос.УстановитьПараметр("ТоварФирмы", ТоварФирмы);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат Не РезультатЗапроса.Пустой(); 
	
КонецФункции

Процедура ПередЗаписью(Отказ)
	
	Если СвязкаСуществует() Тогда
		#Если Клиент Тогда
			Сообщить("По коду " + КодТовараПоставщика + " уже имеется связка в справочнике. Запись элемента отменена" );
		#КонецЕсли
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры
